Tekla Open API Reference for Tekla Structures 2025
AnalysisModelGeneralProperties Constructor
 Creates a new analysis model general properties instance.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public AnalysisModelGeneralProperties()
Public Sub New
See Also
Reference
AnalysisModelGeneralProperties Class
Tekla.Structures.Analysis Namespace